{
  "Home": "الرئيسية",
  "Advantages fasting": "فضل الصيام",
  "More": "المزيد",
  "How many days do you want to fast?": "كم يوم تريد أن تصوم ؟",
  "Silence for a day": "صٌمتٌ يوما",
  "Congratulations, you have completed your day": "تهانينا ، لقد أتتمت يوما",
  "We ask God to accept it from us and from you": "“نسأل الله أن يتقبل منا ومنكم”",
  "Edit the number of days": "تعديل عدد الايام",
  "Add": "إضافة",
  "Determine the number of days you want to fast": "حدد عدد الايام المراد صيامها",
  "Remaining days": "الأيام المتبقية",
  "Done": "تم",
  "Ok": "موافق",
  "Cancel": "الغاء",
  "Fadl_header1": "فضل صيام العشر من ذي الحجة",
  "Fadl_header2": "فضل صيام الإثنين والخميس",
  "Fadl_header3": "فضل صيام الست من شوال",
  "Fadl_header4": "فضل صيام يوم عاشوراء",
  "Fadl_header5": "فضل صيام يوم  عرفه",
  "Fadl_header6": "مبطلات الصيام",
  "Fadl_body1": "عن عبدالله بن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم قال ما من أيَّامٍ العملُ الصَّالحُ فيهنَّ أحبُّ إلى اللهِ من هذه الأيَّامِ العشرِ . قالوا : يا رسولَ اللهِ ولا الجهادُ في سبيلِ اللهِ ؟ فقال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم : ولا الجهادُ في سبيلِ اللهِ إلَّا رجل خرج بنفسِه ومالِه فلم يرجِعْ من ذلك بشيءٍ.\n\nالمحدث : موفق الدين ابن قدامة | المصدر : المغني لابن قدامة | الصفحة أو الرقم : 4/443 | خلاصة حكم المحدث : حسن صحيح | التخريج : أخرجه البخاري (969) باختلاف يسير",
  "Fadl_body2": "جاء عن فضل صيام الاثنين والخميس :\n\nعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال : تُعرضُ الأعمالُ يومَ الإثنين والخميسِ فأُحِبُّ أن يُعرضَ عملي وأنا صائمٌ\n\nوجاء عن فضل صيامهما ايضا:\n\nعن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال: تُفتَحُ أبوابُ الجنَّةِ يومَ الاثنينِ و الخميسِ، فيغفرُ اللهُ عزَّ وجلَّ لِكلِّ عبدٍ لا يُشرِكُ باللهِ شيئًا، إلَّا رجلًا كانَ بينَه وبينَ أخيهِ شحناء، فيقول: أنظروا هذينِ حتَّى يصطلحا، أنظِروا هذينِ حتَّى يصطلِحا ،أنظِروا هذينِ حتَّى يصطلِحا",
  "Fadl_body3": "عَنْ أَبي أَيوبِ رضي الله عنه وارضاه، أَنَّ رسولَ اللَّهِ ﷺ قَالَ: مَنْ صَامَ رَمَضانَ ثُمَّ أَتَبَعَهُ سِتًّا مِنْ شَوَّالٍ كانَ كصِيَامِ الدَّهْرِ. رواهُ مُسْلِمٌ.",
  "Fadl_body4": "عن أبى قتادة رضى الله عنه، أن النبى صلى الله عليه وآله وسلم قال: «صِيَامُ يَوْمِ عَرَفَةَ، أَحْتَسِبُ عَلَى اللهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِى قَبْلَهُ، وَالسَّنَةَ الَّتِى بَعْدَهُ، وَصِيَامُ يَوْمِ عَاشُورَاءَ، أَحْتَسِبُ عَلَى اللهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِى قَبْلَهُ» أخرجه مسلم فى \"صحيحه\".\n\nوعن السيدة عائشة رضى الله عنها: \"أن النبى صلى الله عليه وآله وسلم كان يصوم عاشوراء\" أخرجه مسلم فى \"صحيحه\".\n\nصيام يوم تاسوعاء قبله سُنة أيضًا؛ فعن ابن عباس رضى الله عنهما أن النبى صلى الله عليه وآله وسلم لَمَّا صام يوم عاشوراء قيل له: إن اليهود والنصارى تعظمه، فقال: «فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ إِنْ شَاءَ اللهُ صُمْنَا الْيَوْمَ التَّاسِعَ»، قَالَ ابن عباس: فَلَمْ يَأْتِ الْعَامُ الْمُقْبِلُ حَتَّى تُوُفِّى رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وآله وَسَلَّمَ.\n",
  "Fadl_body5": "عن أبي قتادة الأنصاري رضي الله تعالى عنه: أنَّ رسول الله ﷺ سُئل عن صوم يوم عرفة، فقال: يُكفِّر السنة الماضية والباقية.\n\nعن السيدة عَائِشَة -رضي الله عنه- أنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ:«مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ فِيهِ عَبْداً مِنَ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِى بِهِمُ الْمَلاَئِكَةَ فَيَقُولُ مَا أَرَادَ هَؤُلاَءِ». أخرجه الإمام مسلم في صحيحه (1348)\n\nقال صلى الله عليه وسلم: «صِيَامُ يَوْمِ عَرَفَةَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِى قَبْلَهُ، وَالسَّنَةَ الَّتِى بَعْدَهُ» (أخرجه مسلم في صحيحه: 1162",
  "Fadl_body6": "من مبطلات الصيام:\n\n• الجماع في نهار رمضان.\n• إنزال المني اختيارًا.\n• الأكل والشرب عمدًا. \n• وصول كل ما كان في معنى الأكل والشرب إلى الجوف.\n• التقيؤ عمدًا.\n• خروج دم الحيض والنفاس.\n\nومن مكروهات الصيام ايضا:\n\n• المبالغة فى المضمضة والاستنشاق\n• تقبيل الزوجة ممن لا يأمن على نفسه من تحرك شهوته\n• تذوق الطعام لغير حاجة، بلع النخامة.",
  "Advantage_header1": "نبذه عن التطبيق",
  "Advantage_header2": "الوضع الليلي / الداكن",
  "Advantage_header3": "المصادر",
  "Advantage_header4": "تقييمك يهمنا",
  "Advantage_header5": "مزايا اكثر",
  "Advantage_body1": "تطبيق صيامي هو تطبيق بسيط وسهل الاستخدام تم تصميمه لمساعدة المسلمين في تتبع أيام الصيام المراد قضائها حيث يسمح التطبيق للمستخدمين بإدخال عدد الأيام التي يحتاجون إلى صيامها ويقوم بإرسال تذكيرات يومية لهم للصيام وتتوقف الاشعارات عند صيام جميع الايام.",
  "Advantage_body2": "قمنا باضافة الوضع الليلي في التطبيق حتي لا نؤثر علي تجربة المستخدمين الذين يفضلون هذا الوضع حفاظا علي راحة أعينهم.",
  "Advantage_body3": "مصادر فضل الصيام المذكورة في التطبيق كلها مأخوذه من الكتاب والسنه.",
  "Advantage_body4": "منذ بداية نشر التطبيق ونحن نعمل علي التحديث والتطوير المستمر حتي يتناسب مع كل الهواتف فلا تتردد وتتجاهل تقييم التطبيق لدعمنا.",
  "Advantage_body5": "يحتوي التطبيق علي مميزات كثير لا يمكن حصرها\nاستخدمه واكتشفها.",
  "Share_header1": "شارك التطبيق علي فيسبوك",
  "Share_header2": "شارك التطبيق علي تيليجرام",
  "Share_header3": "شارك التطبيق علي واتساب",
  "Share_header4": "اضغط لنسخ الرابط",
  "Application Advantages": "مزايا التطيبق",
  "Remind me of fasting on Mondays and Thursdays": "ذكرني بصيام الاثنين والخميس",
  "Enable it if you want to receive notifications for fasting on Mondays and Thursdays every week": "فعلها اذا كنت تريد استلام اشعارات بصيام الاثنين والخميس كل اسبوع",
  "Shape": "الشكل",
  "Dark Mode": "الوضع الداكن",
  "Automatic": "تلقائي",
  "Enable it if you want to automatically change the app's interface according to your system's mode": "فعلها اذا كنت تريد تغيير واجهة التطبيق تلقائيا حسب وضع نظامك",
  "Language": "اللغة",
  "Might Interest You": "قد يهمك",
  "How to Use": "كيفية الاستخدام",
  "Share the app": "انشر التطبيق",
  "Rate the App": "تقييم التطبيق",
  "Developer": "المطور",
  "Follow Developer": "تابع المطور",
  "Contact Us About the App": "راسلنا حول التطبيق",
  "Version": "الاصدار",
  "Share the App and Support Us": "شارك التطبيق وادعمنا",
  "youWantToExit": "هل تريد الخروج من التطبيق ؟"
}