{
  "Home": "Home",
  "Advantages fasting": "Fasting Virtues",
  "More": "More",
  "How many days do you want to fast?": "How many days do you want to fast?",
  "Silence for a day": "Fast for a day",
  "Congratulations, you have completed your day": "Congratulations, you have completed a day",
  "We ask God to accept it from us and from you": "“We ask God to accept it from us and from you“",
  "Edit the number of days": "Edit the number of days",
  "Add": "Add",
  "Determine the number of days you want to fast": "Determine the number of days you want to fast",
  "Remaining days": "Remaining days",
  "Ok": "Ok",
  "Done": "Done",
  "Cancel": "Cancel",
  "Fadl_header1": "The Virtue of Fasting the Ten Days of Dhul-Hijjah",
  "Fadl_header2": "The Virtue of Fasting on Mondays and Thursdays",
  "Fadl_header3": "The Virtue of Fasting the Six Days of Shawwal.",
  "Fadl_header4": "The virtue of fasting the white days",
  "Fadl_header5": "The Virtue of Fasting on the Day of Ashura",
  "Fadl_header6": "The Virtue of Fasting on the Day of Arafah",
  "Fadl_header7": "Nullifiers of Fasting",
  "Fadl_body1": "Narrated by Abdullah ibn Abbas (may Allah be pleased with both of them): The Prophet (peace be upon him) said, \"There are no days in which righteous deeds are more beloved to Allah than these ten days.\" The people asked, \"O Messenger of Allah, not even jihad in the way of Allah?\" He replied, \"Not even jihad in the way of Allah, except for a man who went out with his life and his wealth and did not return with anything.\" (Reported by Al-Bukhari)",
  "Fadl_body2": "Regarding the virtue of fasting on Mondays and Thursdays:\n\nNarrated by Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Deeds are presented on the day of Monday and Thursday, and I prefer that my deeds be presented while I am fasting.\"\n\nAlso, concerning the virtue of fasting on these days:\n\nNarrated by Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"The gates of Paradise are opened on Mondays and Thursdays, and Allah, the Almighty, forgives every Muslim servant who does not associate anything with Allah, except for a man who has enmity between him and his brother. It is said, 'Wait for these two until they reconcile, wait for these two until they reconcile, wait for these two until they reconcile.'\"",
  "Fadl_body3": "Narrated by Abu Ayyub (may Allah be pleased with him), the Messenger of Allah ﷺ said: \"Whoever fasts Ramadan and then follows it with six days of Shawwal, it will be as if he fasted for a lifetime.\" (Narrated by Muslim).",
  "Fadl_body4": "Narrated by Abu Dharr (may Allah be pleased with him): The Messenger of Allah (ﷺ) said, \"If you fast three days of the month, then fast the 13th, 14th, and 15th.\" Recorded by al-Tirmidhi, who graded it as a good (hasan) hadith.\n\nNarrated by Qatadah ibn Milhan (may Allah be pleased with him): The Messenger of Allah (ﷺ) used to instruct us to fast on the “white days”: the 13th, 14th, and 15th. Recorded by Abu Dawud.",
  "Fadl_body5": "From Abu Qatadah (may Allah be pleased with him): The Prophet ﷺ said, \"Fasting on the Day of Arafah, I hope, will expiate the sins of the previous year and the coming year.\" (Reported by Imam Muslim in his Sahih).\n\nFrom Aisha (may Allah be pleased with her): \"The Prophet ﷺ used to fast on the Day of Ashura.\" (Reported by Imam Muslim in his Sahih).\n\nFasting on the Day of Tasu'a: Ibn Abbas (may Allah be pleased with them) narrated that when the Prophet ﷺ fasted on the Day of Ashura and was told that the Jews and Christians hold it in high regard, he said, \"If Allah wills, next year we will fast the ninth day.\" However, the Prophet ﷺ passed away before the next year came.",
  "Fadl_body6": "From Abu Qatadah Al-Ansari (may Allah be pleased with him): The Messenger of Allah ﷺ was asked about fasting on the Day of Arafah, and he said, \"It expiates the sins of the past year and the coming year.\"\n\nFrom Aisha (may Allah be pleased with her): The Messenger of Allah ﷺ said, \"There is no day on which Allah frees more people from the Fire than the Day of Arafah. He comes close and expresses His pride to the angels, saying, 'What do these people want?'\" (Reported by Imam Muslim in his Sahih: 1348).\n\nThe Prophet ﷺ said: \"Fasting on the Day of Arafah expiates the sins of the previous year and the coming year.\" (Reported by Imam Muslim in his Sahih: 1162).",
  "Fadl_body7": "Actions that Invalidate Fasting (Mubtilat al-Siyam):\n\n• Sexual intercourse during daylight hours in Ramadan.\n• Ejaculation of semen deliberately.\n• Eating and drinking deliberately.\n• Swallowing anything that is in the nature of food or drink to reach the stomach.\n• Vomiting deliberately.\n• Menstrual or postpartum bleeding.\n\nUndesirable Actions During Fasting (Makruhat al-Siyam):\n\n• Excessive use of mouthwash or nasal irrigation.\n• Kissing one's spouse when one cannot control their desires.\n• Tasting food unnecessarily or swallowing saliva mixed with food remnants.",
  "Advantage_header1": "About the Application",
  "Advantage_header2": "Night Mode / Dark Mode",
  "Advantage_header3": "Sources",
  "Advantage_header4": "Your Rating Matters",
  "Advantage_header5": "More Advantages",
  "Advantage_body1": "Fasting Tracker is a simple and user-friendly app designed to help Muslims track the days of fasting they intend to observe. The app allows users to input the number of days they need to fast and sends them daily reminders to fast until all days are completed.",
  "Advantage_body2": "We have added a night mode feature to the app to enhance the user experience for those who prefer this mode, ensuring their visual comfort.",
  "Advantage_body3": "All the fasting virtues mentioned in the app are sourced from the Quran and Hadith.",
  "Advantage_body4": "Since the app's release, we have been continuously working on updates and improvements to ensure compatibility with all devices. Please do not hesitate to rate the app to support us.",
  "Advantage_body5": "The app includes numerous features that cannot all be listed here.\n Use it and discover them.",
  "Share_header1": "Share the App on Facebook",
  "Share_header2": "Share the App on Telegram",
  "Share_header3": "Share the App on WhatsApp",
  "Share_header4": "Press to Copy the Link",
  "Application Advantages": "Application Advantages",
  "Remind me of fasting on Mondays and Thursdays": "Remind me of fasting on Mondays and Thursdays",
  "Enable it if you want to receive notifications for fasting on Mondays and Thursdays every week": "Enable it if you want to receive notifications for fasting on Mondays and Thursdays every week",
  "whiteDayRemind": "Remind me of fasting the white days",
  "whiteDayRemindContent": "Enable it if you want to receive notifications for fasting on the 13th, 14th, and 15th of each Hijri month",
  "Theme": "Theme",
  "Dark Mode": "Dark Mode",
  "Automatic": "Automatic",
  "changeLanguage": "Change Language",
  "Enable it if you want to automatically change the app's interface according to your system's mode": "Enable it if you want to automatically change the app's interface according to your system's mode",
  "Language": "Language",
  "Might Interest You": "Might Interest You",
  "How to Use": "How to Use",
  "Share the app": "Share the app",
  "Rate the App": "Rate the App",
  "Developer": "Developer",
  "Follow Developer": "Follow Developer",
  "Follow Designer": "Follow Designer",
  "Contact Us About the App": "Contact Us About the App",
  "Version": "Version",
  "Share the App and Support Us": "Share the App and Support Us",
  "youWantToExit": "Do you want to exit the application?"
}
